PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.5 *
       3;* Date/Time created: Mon Jul  9 19:23:59 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("cycle.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.5 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/PRUCookbook/docs/08more/code")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18        .weak   ||CT_CFG||
      19 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1

      83;***************************************************************
      84
      85||main||:
      86;* --------------------------------------------------------------------------*
      87;* r0_0  assigned to $O$C1
      88;* r14_0 assigned to cycle
      89$C$DW$5 .dwtag  DW_TAG_variable, DW_AT_name("cycle")
      90        .dwattr $C$DW$5, DW_AT_TI_symbol_name("cycle")
      91        .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$32)
      92        .dwattr $C$DW$5, DW_AT_location[DW_OP_regx 0x38]
      93        .dwcfi  cfa_offset, 0
      94        .dwpsn  file "cycle.c",line 18,column 2,is_stmt,isa 0
      95;----------------------------------------------------------------------
      96;  18 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
      97;----------------------------------------------------------------------
      98 00000000 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |18| CT_CFG
      99 00000004 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |18| 
     100 00000008 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |18| CT_CFG
     101        .dwpsn  file "cycle.c",line 20,column 2,is_stmt,isa 0
     102;----------------------------------------------------------------------
     103;  20 | PRU0_CTRL.CTRL_bit.CTR_EN = 1;  // Enable cycle counter                
     104;----------------------------------------------------------------------
     105 0000000c 200080240002C0          LDI32     r0, 0x00022000        ; [ALU_PRU] |20| $O$C1
     106 00000014 000000F1002081          LBBO      &r1, r0, 0, 4         ; [ALU_PRU] |20| 
     107 00000018 0000001F03E1E1          SET       r1, r1, 0x00000003    ; [ALU_PRU] |20| 
     108 0000001c 000000E1002081          SBBO      &r1, r0, 0, 4         ; [ALU_PRU] |20| 
     109        .dwpsn  file "cycle.c",line 22,column 2,is_stmt,isa 0
     110;----------------------------------------------------------------------
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    3

     111;  22 | __R30 |= 0x1<<out;                      // Set the GPIO pin to 1       
     112;  23 | // Reset cycle counter, cycle is on the right side to force the compile
     113;     | r                                                                      
     114;  24 | // to put it in it's own register                                      
     115;----------------------------------------------------------------------
     116 00000020 0000001F01FEFE          SET       r30, r30, 0x00000001  ; [ALU_PRU] |22| 
     117        .dwpsn  file "cycle.c",line 25,column 2,is_stmt,isa 0
     118;----------------------------------------------------------------------
     119;  25 | PRU0_CTRL.CYCLE = cycle;                                               
     120;----------------------------------------------------------------------
     121 00000024 000000E10C208E          SBBO      &r14, r0, 12, 4       ; [ALU_PRU] |25| $O$C1,cycle
     122        .dwpsn  file "cycle.c",line 26,column 2,is_stmt,isa 0
     123;----------------------------------------------------------------------
     124;  26 | __R30 &= ~(0x1<<out);           // Clear the GPIO pin                  
     125;----------------------------------------------------------------------
     126 00000028 0000001D01FEFE          CLR       r30, r30, 0x00000001  ; [ALU_PRU] |26| 
     127        .dwpsn  file "cycle.c",line 27,column 2,is_stmt,isa 0
     128;----------------------------------------------------------------------
     129;  27 | cycle = PRU0_CTRL.CYCLE;        // Read cycle and store in a register  
     130;----------------------------------------------------------------------
     131 0000002c 000000F10C2081          LBBO      &r1, r0, 12, 4        ; [ALU_PRU] |27| $O$C1
     132        .dwpsn  file "cycle.c",line 28,column 2,is_stmt,isa 0
     133;----------------------------------------------------------------------
     134;  28 | stall = PRU0_CTRL.STALL;        // Ditto for stall                     
     135;----------------------------------------------------------------------
     136 00000030 000000F1102080          LBBO      &r0, r0, 16, 4        ; [ALU_PRU] |28| $O$C1
     137        .dwpsn  file "cycle.c",line 30,column 2,is_stmt,isa 0
     138;----------------------------------------------------------------------
     139;  30 | __halt();                                                              
     140;----------------------------------------------------------------------
     141 00000034 0000002A000000          HALT      ; [ALU_PRU] |30| 
     142$C$DW$6 .dwtag  DW_TAG_TI_branch
     143        .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     144        .dwattr $C$DW$6, DW_AT_TI_return
     145 00000038 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     146        .dwattr $C$DW$4, DW_AT_TI_end_file("cycle.c")
     147        .dwattr $C$DW$4, DW_AT_TI_end_line(0x1f)
     148        .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     149        .dwendentry
     150        .dwendtag $C$DW$4
     151
     152
     153;******************************************************************************
     154;* TYPE INFORMATION                                                           *
     155;******************************************************************************
     156
     157$C$DW$T$19      .dwtag  DW_TAG_structure_type
     158        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     159$C$DW$7 .dwtag  DW_TAG_member
     160        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     161        .dwattr $C$DW$7, DW_AT_name("REVID")
     162        .dwattr $C$DW$7, DW_AT_TI_symbol_name("REVID")
     163        .dwattr $C$DW$7, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     164        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     165        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    4

     166        .dwattr $C$DW$7, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     167        .dwattr $C$DW$7, DW_AT_decl_line(0x2d)
     168        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     169        .dwendtag $C$DW$T$19
     170
     171        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     172        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     173        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     174$C$DW$T$48      .dwtag  DW_TAG_volatile_type
     175        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
     176
     177$C$DW$T$20      .dwtag  DW_TAG_structure_type
     178        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     179$C$DW$8 .dwtag  DW_TAG_member
     180        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     181        .dwattr $C$DW$8, DW_AT_name("IDLE_MODE")
     182        .dwattr $C$DW$8, DW_AT_TI_symbol_name("IDLE_MODE")
     183        .dwattr $C$DW$8, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     184        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     185        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     186        .dwattr $C$DW$8, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     187        .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     188        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     189$C$DW$9 .dwtag  DW_TAG_member
     190        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     191        .dwattr $C$DW$9, DW_AT_name("STANDBY_MODE")
     192        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_MODE")
     193        .dwattr $C$DW$9, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     194        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     195        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     196        .dwattr $C$DW$9, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     197        .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     198        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     199$C$DW$10        .dwtag  DW_TAG_member
     200        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     201        .dwattr $C$DW$10, DW_AT_name("STANDBY_INIT")
     202        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_INIT")
     203        .dwattr $C$DW$10, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     204        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     205        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     206        .dwattr $C$DW$10, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     207        .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     208        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     209$C$DW$11        .dwtag  DW_TAG_member
     210        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     211        .dwattr $C$DW$11, DW_AT_name("SUB_MWAIT")
     212        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SUB_MWAIT")
     213        .dwattr $C$DW$11, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     214        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     215        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     216        .dwattr $C$DW$11, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     217        .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     218        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     219$C$DW$12        .dwtag  DW_TAG_member
     220        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    5

     221        .dwattr $C$DW$12, DW_AT_name("rsvd6")
     222        .dwattr $C$DW$12, DW_AT_TI_symbol_name("rsvd6")
     223        .dwattr $C$DW$12, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     224        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     225        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     226        .dwattr $C$DW$12, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     227        .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     228        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     229        .dwendtag $C$DW$T$20
     230
     231        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     232        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     233        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     234$C$DW$T$50      .dwtag  DW_TAG_volatile_type
     235        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$20)
     236
     237$C$DW$T$21      .dwtag  DW_TAG_structure_type
     238        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     239$C$DW$13        .dwtag  DW_TAG_member
     240        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     241        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_MODE")
     242        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     243        .dwattr $C$DW$13, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     244        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     245        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     246        .dwattr $C$DW$13, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     247        .dwattr $C$DW$13, DW_AT_decl_line(0x45)
     248        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     249$C$DW$14        .dwtag  DW_TAG_member
     250        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     251        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_CLK_MODE")
     252        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     253        .dwattr $C$DW$14, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     254        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     255        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     256        .dwattr $C$DW$14, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     257        .dwattr $C$DW$14, DW_AT_decl_line(0x46)
     258        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     259$C$DW$15        .dwtag  DW_TAG_member
     260        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     261        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV0")
     262        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     263        .dwattr $C$DW$15, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     264        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     265        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     266        .dwattr $C$DW$15, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     267        .dwattr $C$DW$15, DW_AT_decl_line(0x47)
     268        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     269$C$DW$16        .dwtag  DW_TAG_member
     270        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     271        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV1")
     272        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     273        .dwattr $C$DW$16, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     274        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     275        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    6

     276        .dwattr $C$DW$16, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     277        .dwattr $C$DW$16, DW_AT_decl_line(0x48)
     278        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     279$C$DW$17        .dwtag  DW_TAG_member
     280        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     281        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_SB")
     282        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     283        .dwattr $C$DW$17, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     284        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     285        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     286        .dwattr $C$DW$17, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     287        .dwattr $C$DW$17, DW_AT_decl_line(0x49)
     288        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     289$C$DW$18        .dwtag  DW_TAG_member
     290        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     291        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_MODE")
     292        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     293        .dwattr $C$DW$18, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     294        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     295        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     296        .dwattr $C$DW$18, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     297        .dwattr $C$DW$18, DW_AT_decl_line(0x4a)
     298        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     299$C$DW$19        .dwtag  DW_TAG_member
     300        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     301        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV0")
     302        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     303        .dwattr $C$DW$19, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     304        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     305        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     306        .dwattr $C$DW$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     307        .dwattr $C$DW$19, DW_AT_decl_line(0x4b)
     308        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     309$C$DW$20        .dwtag  DW_TAG_member
     310        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     311        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV1")
     312        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     313        .dwattr $C$DW$20, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     314        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     315        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     316        .dwattr $C$DW$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     317        .dwattr $C$DW$20, DW_AT_decl_line(0x4c)
     318        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     319$C$DW$21        .dwtag  DW_TAG_member
     320        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     321        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_SH_SEL")
     322        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     323        .dwattr $C$DW$21, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     324        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     325        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     326        .dwattr $C$DW$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     327        .dwattr $C$DW$21, DW_AT_decl_line(0x4d)
     328        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     329$C$DW$22        .dwtag  DW_TAG_member
     330        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    7

     331        .dwattr $C$DW$22, DW_AT_name("rsvd26")
     332        .dwattr $C$DW$22, DW_AT_TI_symbol_name("rsvd26")
     333        .dwattr $C$DW$22, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     334        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     335        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     336        .dwattr $C$DW$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     337        .dwattr $C$DW$22, DW_AT_decl_line(0x4e)
     338        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     339        .dwendtag $C$DW$T$21
     340
     341        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     342        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     343        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     344$C$DW$T$52      .dwtag  DW_TAG_volatile_type
     345        .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$21)
     346
     347$C$DW$T$22      .dwtag  DW_TAG_structure_type
     348        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     349$C$DW$23        .dwtag  DW_TAG_member
     350        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     351        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_MODE")
     352        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     353        .dwattr $C$DW$23, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     354        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     355        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     356        .dwattr $C$DW$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     357        .dwattr $C$DW$23, DW_AT_decl_line(0x58)
     358        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     359$C$DW$24        .dwtag  DW_TAG_member
     360        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     361        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_CLK_MODE")
     362        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     363        .dwattr $C$DW$24, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     364        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     365        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     366        .dwattr $C$DW$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     367        .dwattr $C$DW$24, DW_AT_decl_line(0x59)
     368        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     369$C$DW$25        .dwtag  DW_TAG_member
     370        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     371        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV0")
     372        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     373        .dwattr $C$DW$25, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     374        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     376        .dwattr $C$DW$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     377        .dwattr $C$DW$25, DW_AT_decl_line(0x5a)
     378        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     379$C$DW$26        .dwtag  DW_TAG_member
     380        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     381        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV1")
     382        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     383        .dwattr $C$DW$26, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     384        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     385        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    8

     386        .dwattr $C$DW$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     387        .dwattr $C$DW$26, DW_AT_decl_line(0x5b)
     388        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     389$C$DW$27        .dwtag  DW_TAG_member
     390        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     391        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_SB")
     392        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     393        .dwattr $C$DW$27, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     394        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     395        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     396        .dwattr $C$DW$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     397        .dwattr $C$DW$27, DW_AT_decl_line(0x5c)
     398        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     399$C$DW$28        .dwtag  DW_TAG_member
     400        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     401        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_MODE")
     402        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     403        .dwattr $C$DW$28, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     404        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     405        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     406        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     407        .dwattr $C$DW$28, DW_AT_decl_line(0x5d)
     408        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     409$C$DW$29        .dwtag  DW_TAG_member
     410        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     411        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV0")
     412        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     413        .dwattr $C$DW$29, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     414        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     415        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     416        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     417        .dwattr $C$DW$29, DW_AT_decl_line(0x5e)
     418        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     419$C$DW$30        .dwtag  DW_TAG_member
     420        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     421        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV1")
     422        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     423        .dwattr $C$DW$30, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     424        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     425        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     426        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     427        .dwattr $C$DW$30, DW_AT_decl_line(0x5f)
     428        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     429$C$DW$31        .dwtag  DW_TAG_member
     430        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     431        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_SH_SEL")
     432        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     433        .dwattr $C$DW$31, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     434        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     435        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     436        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     437        .dwattr $C$DW$31, DW_AT_decl_line(0x60)
     438        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     439$C$DW$32        .dwtag  DW_TAG_member
     440        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE    9

     441        .dwattr $C$DW$32, DW_AT_name("rsvd26")
     442        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd26")
     443        .dwattr $C$DW$32, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     444        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     445        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     446        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     447        .dwattr $C$DW$32, DW_AT_decl_line(0x61)
     448        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     449        .dwendtag $C$DW$T$22
     450
     451        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     452        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     453        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     454$C$DW$T$54      .dwtag  DW_TAG_volatile_type
     455        .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$22)
     456
     457$C$DW$T$23      .dwtag  DW_TAG_structure_type
     458        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     459$C$DW$33        .dwtag  DW_TAG_member
     460        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     461        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_REQ")
     462        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     463        .dwattr $C$DW$33, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     464        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     465        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     466        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     467        .dwattr $C$DW$33, DW_AT_decl_line(0x6b)
     468        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     469$C$DW$34        .dwtag  DW_TAG_member
     470        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     471        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_ACK")
     472        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     473        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     474        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     475        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     476        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     477        .dwattr $C$DW$34, DW_AT_decl_line(0x6c)
     478        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     479$C$DW$35        .dwtag  DW_TAG_member
     480        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     481        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_EN")
     482        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     483        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     484        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     485        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     486        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     487        .dwattr $C$DW$35, DW_AT_decl_line(0x6d)
     488        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     489$C$DW$36        .dwtag  DW_TAG_member
     490        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     491        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_REQ")
     492        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     493        .dwattr $C$DW$36, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     494        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     495        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   10

     496        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     497        .dwattr $C$DW$36, DW_AT_decl_line(0x6e)
     498        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     499$C$DW$37        .dwtag  DW_TAG_member
     500        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     501        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_ACK")
     502        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     503        .dwattr $C$DW$37, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     504        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     506        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     507        .dwattr $C$DW$37, DW_AT_decl_line(0x6f)
     508        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     509$C$DW$38        .dwtag  DW_TAG_member
     510        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     511        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_EN")
     512        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     513        .dwattr $C$DW$38, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     514        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     515        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     516        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     517        .dwattr $C$DW$38, DW_AT_decl_line(0x70)
     518        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     519$C$DW$39        .dwtag  DW_TAG_member
     520        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     521        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_REQ")
     522        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     523        .dwattr $C$DW$39, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     524        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     525        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     526        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     527        .dwattr $C$DW$39, DW_AT_decl_line(0x71)
     528        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     529$C$DW$40        .dwtag  DW_TAG_member
     530        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     531        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_ACK")
     532        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     533        .dwattr $C$DW$40, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     534        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     535        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     536        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     537        .dwattr $C$DW$40, DW_AT_decl_line(0x72)
     538        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     539$C$DW$41        .dwtag  DW_TAG_member
     540        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     541        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_EN")
     542        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_EN")
     543        .dwattr $C$DW$41, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     544        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     546        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     547        .dwattr $C$DW$41, DW_AT_decl_line(0x73)
     548        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     549$C$DW$42        .dwtag  DW_TAG_member
     550        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   11

     551        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_REQ")
     552        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     553        .dwattr $C$DW$42, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     554        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     555        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     556        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     557        .dwattr $C$DW$42, DW_AT_decl_line(0x74)
     558        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     559$C$DW$43        .dwtag  DW_TAG_member
     560        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     561        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_ACK")
     562        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     563        .dwattr $C$DW$43, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     564        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     565        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     566        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     567        .dwattr $C$DW$43, DW_AT_decl_line(0x75)
     568        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     569$C$DW$44        .dwtag  DW_TAG_member
     570        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     571        .dwattr $C$DW$44, DW_AT_name("UART_CLK_EN")
     572        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_EN")
     573        .dwattr $C$DW$44, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     574        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     576        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     577        .dwattr $C$DW$44, DW_AT_decl_line(0x76)
     578        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     579$C$DW$45        .dwtag  DW_TAG_member
     580        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     581        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_REQ")
     582        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     583        .dwattr $C$DW$45, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     584        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     586        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     587        .dwattr $C$DW$45, DW_AT_decl_line(0x77)
     588        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     589$C$DW$46        .dwtag  DW_TAG_member
     590        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     591        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_ACK")
     592        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     593        .dwattr $C$DW$46, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     594        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     596        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     597        .dwattr $C$DW$46, DW_AT_decl_line(0x78)
     598        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     599$C$DW$47        .dwtag  DW_TAG_member
     600        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     601        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_EN")
     602        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     603        .dwattr $C$DW$47, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     604        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     605        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   12

     606        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     607        .dwattr $C$DW$47, DW_AT_decl_line(0x79)
     608        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     609$C$DW$48        .dwtag  DW_TAG_member
     610        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     611        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_REQ")
     612        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     613        .dwattr $C$DW$48, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     614        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     616        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     617        .dwattr $C$DW$48, DW_AT_decl_line(0x7a)
     618        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     619$C$DW$49        .dwtag  DW_TAG_member
     620        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     621        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_ACK")
     622        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     623        .dwattr $C$DW$49, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     624        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     626        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     627        .dwattr $C$DW$49, DW_AT_decl_line(0x7b)
     628        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     629$C$DW$50        .dwtag  DW_TAG_member
     630        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     631        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_EN")
     632        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_EN")
     633        .dwattr $C$DW$50, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     634        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     635        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     636        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     637        .dwattr $C$DW$50, DW_AT_decl_line(0x7c)
     638        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     639$C$DW$51        .dwtag  DW_TAG_member
     640        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     641        .dwattr $C$DW$51, DW_AT_name("rsvd18")
     642        .dwattr $C$DW$51, DW_AT_TI_symbol_name("rsvd18")
     643        .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     644        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     646        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     647        .dwattr $C$DW$51, DW_AT_decl_line(0x7d)
     648        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     649        .dwendtag $C$DW$T$23
     650
     651        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     652        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     653        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     654$C$DW$T$56      .dwtag  DW_TAG_volatile_type
     655        .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$23)
     656
     657$C$DW$T$24      .dwtag  DW_TAG_structure_type
     658        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     659$C$DW$52        .dwtag  DW_TAG_member
     660        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   13

     661        .dwattr $C$DW$52, DW_AT_name("PRU0_IMEM_PE_RAW")
     662        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     663        .dwattr $C$DW$52, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     664        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     666        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     667        .dwattr $C$DW$52, DW_AT_decl_line(0x87)
     668        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     669$C$DW$53        .dwtag  DW_TAG_member
     670        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     671        .dwattr $C$DW$53, DW_AT_name("PRU0_DMEM_PE_RAW")
     672        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     673        .dwattr $C$DW$53, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     674        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     675        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     676        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     677        .dwattr $C$DW$53, DW_AT_decl_line(0x88)
     678        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     679$C$DW$54        .dwtag  DW_TAG_member
     680        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     681        .dwattr $C$DW$54, DW_AT_name("PRU1_IMEM_PE_RAW")
     682        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     683        .dwattr $C$DW$54, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     684        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     685        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     686        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     687        .dwattr $C$DW$54, DW_AT_decl_line(0x89)
     688        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     689$C$DW$55        .dwtag  DW_TAG_member
     690        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     691        .dwattr $C$DW$55, DW_AT_name("PRU1_DMEM_PE_RAW")
     692        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     693        .dwattr $C$DW$55, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     694        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     696        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     697        .dwattr $C$DW$55, DW_AT_decl_line(0x8a)
     698        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     699$C$DW$56        .dwtag  DW_TAG_member
     700        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     701        .dwattr $C$DW$56, DW_AT_name("RAM_PE_RAW")
     702        .dwattr $C$DW$56, DW_AT_TI_symbol_name("RAM_PE_RAW")
     703        .dwattr $C$DW$56, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     704        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     706        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     707        .dwattr $C$DW$56, DW_AT_decl_line(0x8b)
     708        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     709$C$DW$57        .dwtag  DW_TAG_member
     710        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     711        .dwattr $C$DW$57, DW_AT_name("rsvd20")
     712        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd20")
     713        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     714        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   14

     716        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     717        .dwattr $C$DW$57, DW_AT_decl_line(0x8c)
     718        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     719        .dwendtag $C$DW$T$24
     720
     721        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     722        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     723        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     724$C$DW$T$58      .dwtag  DW_TAG_volatile_type
     725        .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$24)
     726
     727$C$DW$T$25      .dwtag  DW_TAG_structure_type
     728        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     729$C$DW$58        .dwtag  DW_TAG_member
     730        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     731        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE")
     732        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     733        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     734        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     736        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     737        .dwattr $C$DW$58, DW_AT_decl_line(0x96)
     738        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     739$C$DW$59        .dwtag  DW_TAG_member
     740        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     741        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE")
     742        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     743        .dwattr $C$DW$59, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     744        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     746        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     747        .dwattr $C$DW$59, DW_AT_decl_line(0x97)
     748        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     749$C$DW$60        .dwtag  DW_TAG_member
     750        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     751        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE")
     752        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     753        .dwattr $C$DW$60, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     754        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     756        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     757        .dwattr $C$DW$60, DW_AT_decl_line(0x98)
     758        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     759$C$DW$61        .dwtag  DW_TAG_member
     760        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     761        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE")
     762        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     763        .dwattr $C$DW$61, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     764        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     765        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     766        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     767        .dwattr $C$DW$61, DW_AT_decl_line(0x99)
     768        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     769$C$DW$62        .dwtag  DW_TAG_member
     770        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   15

     771        .dwattr $C$DW$62, DW_AT_name("RAM_PE")
     772        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE")
     773        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     774        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     775        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     776        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     777        .dwattr $C$DW$62, DW_AT_decl_line(0x9a)
     778        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     779$C$DW$63        .dwtag  DW_TAG_member
     780        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     781        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     782        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     783        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     784        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     785        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     786        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     787        .dwattr $C$DW$63, DW_AT_decl_line(0x9b)
     788        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     789        .dwendtag $C$DW$T$25
     790
     791        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     792        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     793        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     794$C$DW$T$60      .dwtag  DW_TAG_volatile_type
     795        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$25)
     796
     797$C$DW$T$26      .dwtag  DW_TAG_structure_type
     798        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     799$C$DW$64        .dwtag  DW_TAG_member
     800        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     801        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE_SET")
     802        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     803        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     804        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     806        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     807        .dwattr $C$DW$64, DW_AT_decl_line(0xa4)
     808        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     809$C$DW$65        .dwtag  DW_TAG_member
     810        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     811        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE_SET")
     812        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     813        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     814        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     816        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     817        .dwattr $C$DW$65, DW_AT_decl_line(0xa5)
     818        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     819$C$DW$66        .dwtag  DW_TAG_member
     820        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     821        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE_SET")
     822        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     823        .dwattr $C$DW$66, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     824        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   16

     826        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     827        .dwattr $C$DW$66, DW_AT_decl_line(0xa6)
     828        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     829$C$DW$67        .dwtag  DW_TAG_member
     830        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     831        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE_SET")
     832        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     833        .dwattr $C$DW$67, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     834        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     836        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     837        .dwattr $C$DW$67, DW_AT_decl_line(0xa7)
     838        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     839$C$DW$68        .dwtag  DW_TAG_member
     840        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     841        .dwattr $C$DW$68, DW_AT_name("RAM_PE_SET")
     842        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE_SET")
     843        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     844        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     846        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     847        .dwattr $C$DW$68, DW_AT_decl_line(0xa8)
     848        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     849$C$DW$69        .dwtag  DW_TAG_member
     850        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     851        .dwattr $C$DW$69, DW_AT_name("rsvd20")
     852        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     853        .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     854        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     856        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     857        .dwattr $C$DW$69, DW_AT_decl_line(0xa9)
     858        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     859        .dwendtag $C$DW$T$26
     860
     861        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     862        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     863        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     864$C$DW$T$62      .dwtag  DW_TAG_volatile_type
     865        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$26)
     866
     867$C$DW$T$27      .dwtag  DW_TAG_structure_type
     868        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     869$C$DW$70        .dwtag  DW_TAG_member
     870        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     871        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_CLR")
     872        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     873        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     874        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     876        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     877        .dwattr $C$DW$70, DW_AT_decl_line(0xb3)
     878        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     879$C$DW$71        .dwtag  DW_TAG_member
     880        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   17

     881        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_CLR")
     882        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     883        .dwattr $C$DW$71, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     884        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     886        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     887        .dwattr $C$DW$71, DW_AT_decl_line(0xb4)
     888        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     889$C$DW$72        .dwtag  DW_TAG_member
     890        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     891        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_CLR")
     892        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     893        .dwattr $C$DW$72, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     894        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     896        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     897        .dwattr $C$DW$72, DW_AT_decl_line(0xb5)
     898        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     899$C$DW$73        .dwtag  DW_TAG_member
     900        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     901        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_CLR")
     902        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     903        .dwattr $C$DW$73, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     904        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     906        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     907        .dwattr $C$DW$73, DW_AT_decl_line(0xb6)
     908        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     909$C$DW$74        .dwtag  DW_TAG_member
     910        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     911        .dwattr $C$DW$74, DW_AT_name("rsvd16")
     912        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd16")
     913        .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     914        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     916        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     917        .dwattr $C$DW$74, DW_AT_decl_line(0xb7)
     918        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     919        .dwendtag $C$DW$T$27
     920
     921        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     922        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     923        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     924$C$DW$T$64      .dwtag  DW_TAG_volatile_type
     925        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$27)
     926
     927$C$DW$T$28      .dwtag  DW_TAG_structure_type
     928        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     929$C$DW$75        .dwtag  DW_TAG_member
     930        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     931        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU0")
     932        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU0")
     933        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     934        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   18

     936        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     937        .dwattr $C$DW$75, DW_AT_decl_line(0xc4)
     938        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     939$C$DW$76        .dwtag  DW_TAG_member
     940        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     941        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU1")
     942        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU1")
     943        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     944        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     946        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     947        .dwattr $C$DW$76, DW_AT_decl_line(0xc5)
     948        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     949$C$DW$77        .dwtag  DW_TAG_member
     950        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     951        .dwattr $C$DW$77, DW_AT_name("rsvd2")
     952        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd2")
     953        .dwattr $C$DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     954        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     956        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     957        .dwattr $C$DW$77, DW_AT_decl_line(0xc6)
     958        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     959        .dwendtag $C$DW$T$28
     960
     961        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     962        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     963        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     964$C$DW$T$66      .dwtag  DW_TAG_volatile_type
     965        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$28)
     966
     967$C$DW$T$29      .dwtag  DW_TAG_structure_type
     968        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     969$C$DW$78        .dwtag  DW_TAG_member
     970        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     971        .dwattr $C$DW$78, DW_AT_name("OCP_EN")
     972        .dwattr $C$DW$78, DW_AT_TI_symbol_name("OCP_EN")
     973        .dwattr $C$DW$78, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     974        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     976        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     977        .dwattr $C$DW$78, DW_AT_decl_line(0xd3)
     978        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     979$C$DW$79        .dwtag  DW_TAG_member
     980        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
     981        .dwattr $C$DW$79, DW_AT_name("rsvd1")
     982        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd1")
     983        .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
     984        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     986        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     987        .dwattr $C$DW$79, DW_AT_decl_line(0xd4)
     988        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     989        .dwendtag $C$DW$T$29
     990
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   19

     991        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     992        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
     993        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
     994$C$DW$T$68      .dwtag  DW_TAG_volatile_type
     995        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
     996
     997$C$DW$T$30      .dwtag  DW_TAG_structure_type
     998        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
     999$C$DW$80        .dwtag  DW_TAG_member
    1000        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1001        .dwattr $C$DW$80, DW_AT_name("PRU1_PAD_HP_EN")
    1002        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1003        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1004        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1006        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1007        .dwattr $C$DW$80, DW_AT_decl_line(0xde)
    1008        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1009$C$DW$81        .dwtag  DW_TAG_member
    1010        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1011        .dwattr $C$DW$81, DW_AT_name("XFR_SHIFT_EN")
    1012        .dwattr $C$DW$81, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1013        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1014        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1016        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1017        .dwattr $C$DW$81, DW_AT_decl_line(0xdf)
    1018        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1019$C$DW$82        .dwtag  DW_TAG_member
    1020        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1021        .dwattr $C$DW$82, DW_AT_name("rsvd2")
    1022        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd2")
    1023        .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1024        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1025        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1026        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1027        .dwattr $C$DW$82, DW_AT_decl_line(0xe0)
    1028        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1029        .dwendtag $C$DW$T$30
    1030
    1031        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1032        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1033        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1034$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    1035        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$30)
    1036
    1037$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1038        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1039$C$DW$83        .dwtag  DW_TAG_member
    1040        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1041        .dwattr $C$DW$83, DW_AT_name("PIN_MUX_SEL")
    1042        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1043        .dwattr $C$DW$83, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1044        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   20

    1046        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1047        .dwattr $C$DW$83, DW_AT_decl_line(0xec)
    1048        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1049$C$DW$84        .dwtag  DW_TAG_member
    1050        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1051        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1052        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1053        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1054        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1056        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1057        .dwattr $C$DW$84, DW_AT_decl_line(0xed)
    1058        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1059        .dwendtag $C$DW$T$31
    1060
    1061        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1062        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1063        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1064$C$DW$T$72      .dwtag  DW_TAG_volatile_type
    1065        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$31)
    1066
    1067$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1068        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1069$C$DW$85        .dwtag  DW_TAG_member
    1070        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$49)
    1071        .dwattr $C$DW$85, DW_AT_name("$P$T0")
    1072        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T0")
    1073        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1075        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1076        .dwattr $C$DW$85, DW_AT_decl_line(0x29)
    1077        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1078$C$DW$86        .dwtag  DW_TAG_member
    1079        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$51)
    1080        .dwattr $C$DW$86, DW_AT_name("$P$T1")
    1081        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T1")
    1082        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1083        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1084        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1085        .dwattr $C$DW$86, DW_AT_decl_line(0x33)
    1086        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1087$C$DW$87        .dwtag  DW_TAG_member
    1088        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$53)
    1089        .dwattr $C$DW$87, DW_AT_name("$P$T2")
    1090        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T2")
    1091        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1092        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1093        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1094        .dwattr $C$DW$87, DW_AT_decl_line(0x41)
    1095        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1096$C$DW$88        .dwtag  DW_TAG_member
    1097        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$55)
    1098        .dwattr $C$DW$88, DW_AT_name("$P$T3")
    1099        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T3")
    1100        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   21

    1101        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1102        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1103        .dwattr $C$DW$88, DW_AT_decl_line(0x54)
    1104        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1105$C$DW$89        .dwtag  DW_TAG_member
    1106        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$57)
    1107        .dwattr $C$DW$89, DW_AT_name("$P$T4")
    1108        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T4")
    1109        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1110        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1111        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1112        .dwattr $C$DW$89, DW_AT_decl_line(0x67)
    1113        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1114$C$DW$90        .dwtag  DW_TAG_member
    1115        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$59)
    1116        .dwattr $C$DW$90, DW_AT_name("$P$T5")
    1117        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T5")
    1118        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1119        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1120        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1121        .dwattr $C$DW$90, DW_AT_decl_line(0x83)
    1122        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1123$C$DW$91        .dwtag  DW_TAG_member
    1124        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$61)
    1125        .dwattr $C$DW$91, DW_AT_name("$P$T6")
    1126        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T6")
    1127        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1128        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1129        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1130        .dwattr $C$DW$91, DW_AT_decl_line(0x92)
    1131        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1132$C$DW$92        .dwtag  DW_TAG_member
    1133        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$63)
    1134        .dwattr $C$DW$92, DW_AT_name("$P$T7")
    1135        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T7")
    1136        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1137        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1138        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1139        .dwattr $C$DW$92, DW_AT_decl_line(0xa0)
    1140        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1141$C$DW$93        .dwtag  DW_TAG_member
    1142        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$65)
    1143        .dwattr $C$DW$93, DW_AT_name("$P$T8")
    1144        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T8")
    1145        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1146        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1147        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1148        .dwattr $C$DW$93, DW_AT_decl_line(0xaf)
    1149        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1150$C$DW$94        .dwtag  DW_TAG_member
    1151        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
    1152        .dwattr $C$DW$94, DW_AT_name("rsvd24")
    1153        .dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd24")
    1154        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1155        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   22

    1156        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1157        .dwattr $C$DW$94, DW_AT_decl_line(0xbc)
    1158        .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1159$C$DW$95        .dwtag  DW_TAG_member
    1160        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$67)
    1161        .dwattr $C$DW$95, DW_AT_name("$P$T9")
    1162        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T9")
    1163        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1164        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1165        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1166        .dwattr $C$DW$95, DW_AT_decl_line(0xc0)
    1167        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1168$C$DW$96        .dwtag  DW_TAG_member
    1169        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1170        .dwattr $C$DW$96, DW_AT_name("rsvd2c")
    1171        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd2c")
    1172        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1173        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1174        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1175        .dwattr $C$DW$96, DW_AT_decl_line(0xcb)
    1176        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1177$C$DW$97        .dwtag  DW_TAG_member
    1178        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$69)
    1179        .dwattr $C$DW$97, DW_AT_name("$P$T10")
    1180        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T10")
    1181        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1182        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1183        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1184        .dwattr $C$DW$97, DW_AT_decl_line(0xcf)
    1185        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1186$C$DW$98        .dwtag  DW_TAG_member
    1187        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$71)
    1188        .dwattr $C$DW$98, DW_AT_name("$P$T11")
    1189        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T11")
    1190        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1191        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1192        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1193        .dwattr $C$DW$98, DW_AT_decl_line(0xda)
    1194        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1195$C$DW$99        .dwtag  DW_TAG_member
    1196        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1197        .dwattr $C$DW$99, DW_AT_name("rsvd38")
    1198        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd38")
    1199        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1200        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1201        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1202        .dwattr $C$DW$99, DW_AT_decl_line(0xe5)
    1203        .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1204$C$DW$100       .dwtag  DW_TAG_member
    1205        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$73)
    1206        .dwattr $C$DW$100, DW_AT_name("$P$T12")
    1207        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T12")
    1208        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1209        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1210        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   23

    1211        .dwattr $C$DW$100, DW_AT_decl_line(0xe8)
    1212        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1213        .dwendtag $C$DW$T$35
    1214
    1215        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1216        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1217        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1218$C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1219        .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$35)
    1220        .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1221        .dwattr $C$DW$T$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1222        .dwattr $C$DW$T$97, DW_AT_decl_line(0xf0)
    1223        .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    1224$C$DW$T$98      .dwtag  DW_TAG_volatile_type
    1225        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    1226
    1227$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1228        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1229$C$DW$101       .dwtag  DW_TAG_member
    1230        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1231        .dwattr $C$DW$101, DW_AT_name("SOFT_RST_N")
    1232        .dwattr $C$DW$101, DW_AT_TI_symbol_name("SOFT_RST_N")
    1233        .dwattr $C$DW$101, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1234        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1236        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1237        .dwattr $C$DW$101, DW_AT_decl_line(0x2d)
    1238        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1239$C$DW$102       .dwtag  DW_TAG_member
    1240        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1241        .dwattr $C$DW$102, DW_AT_name("EN")
    1242        .dwattr $C$DW$102, DW_AT_TI_symbol_name("EN")
    1243        .dwattr $C$DW$102, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1244        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1246        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1247        .dwattr $C$DW$102, DW_AT_decl_line(0x2e)
    1248        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1249$C$DW$103       .dwtag  DW_TAG_member
    1250        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1251        .dwattr $C$DW$103, DW_AT_name("SLEEPING")
    1252        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SLEEPING")
    1253        .dwattr $C$DW$103, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1254        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1256        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1257        .dwattr $C$DW$103, DW_AT_decl_line(0x2f)
    1258        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1259$C$DW$104       .dwtag  DW_TAG_member
    1260        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1261        .dwattr $C$DW$104, DW_AT_name("CTR_EN")
    1262        .dwattr $C$DW$104, DW_AT_TI_symbol_name("CTR_EN")
    1263        .dwattr $C$DW$104, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1264        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   24

    1266        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1267        .dwattr $C$DW$104, DW_AT_decl_line(0x30)
    1268        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1269$C$DW$105       .dwtag  DW_TAG_member
    1270        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1271        .dwattr $C$DW$105, DW_AT_name("rsvd4")
    1272        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd4")
    1273        .dwattr $C$DW$105, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1274        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1276        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1277        .dwattr $C$DW$105, DW_AT_decl_line(0x31)
    1278        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1279$C$DW$106       .dwtag  DW_TAG_member
    1280        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1281        .dwattr $C$DW$106, DW_AT_name("SINGLE_STEP")
    1282        .dwattr $C$DW$106, DW_AT_TI_symbol_name("SINGLE_STEP")
    1283        .dwattr $C$DW$106, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1284        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1286        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1287        .dwattr $C$DW$106, DW_AT_decl_line(0x32)
    1288        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1289$C$DW$107       .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1291        .dwattr $C$DW$107, DW_AT_name("rsvd9")
    1292        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd9")
    1293        .dwattr $C$DW$107, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x06)
    1294        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1296        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1297        .dwattr $C$DW$107, DW_AT_decl_line(0x33)
    1298        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1299$C$DW$108       .dwtag  DW_TAG_member
    1300        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1301        .dwattr $C$DW$108, DW_AT_name("RUNSTATE")
    1302        .dwattr $C$DW$108, DW_AT_TI_symbol_name("RUNSTATE")
    1303        .dwattr $C$DW$108, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1304        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1306        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1307        .dwattr $C$DW$108, DW_AT_decl_line(0x34)
    1308        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1309$C$DW$109       .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1311        .dwattr $C$DW$109, DW_AT_name("PCTR_RST_VAL")
    1312        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PCTR_RST_VAL")
    1313        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1314        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1316        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1317        .dwattr $C$DW$109, DW_AT_decl_line(0x35)
    1318        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1319        .dwendtag $C$DW$T$36
    1320
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   25

    1321        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1322        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    1323        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1324$C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1325        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    1326
    1327$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1328        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1329$C$DW$110       .dwtag  DW_TAG_member
    1330        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1331        .dwattr $C$DW$110, DW_AT_name("PCTR")
    1332        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PCTR")
    1333        .dwattr $C$DW$110, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x10)
    1334        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1336        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1337        .dwattr $C$DW$110, DW_AT_decl_line(0x3f)
    1338        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1339$C$DW$111       .dwtag  DW_TAG_member
    1340        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1341        .dwattr $C$DW$111, DW_AT_name("rsvd16")
    1342        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd16")
    1343        .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1344        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1346        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1347        .dwattr $C$DW$111, DW_AT_decl_line(0x40)
    1348        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1349        .dwendtag $C$DW$T$37
    1350
    1351        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1352        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3e)
    1353        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1354$C$DW$T$76      .dwtag  DW_TAG_volatile_type
    1355        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$37)
    1356
    1357$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1358        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1359$C$DW$112       .dwtag  DW_TAG_member
    1360        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1361        .dwattr $C$DW$112, DW_AT_name("BITWISE_ENS")
    1362        .dwattr $C$DW$112, DW_AT_TI_symbol_name("BITWISE_ENS")
    1363        .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1364        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1366        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1367        .dwattr $C$DW$112, DW_AT_decl_line(0x4a)
    1368        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1369        .dwendtag $C$DW$T$38
    1370
    1371        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1372        .dwattr $C$DW$T$38, DW_AT_decl_line(0x49)
    1373        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1374$C$DW$T$78      .dwtag  DW_TAG_volatile_type
    1375        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$38)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   26

    1376
    1377$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1378        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1379$C$DW$113       .dwtag  DW_TAG_member
    1380        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1381        .dwattr $C$DW$113, DW_AT_name("CYCLECOUNT")
    1382        .dwattr $C$DW$113, DW_AT_TI_symbol_name("CYCLECOUNT")
    1383        .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1384        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1386        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1387        .dwattr $C$DW$113, DW_AT_decl_line(0x54)
    1388        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1389        .dwendtag $C$DW$T$39
    1390
    1391        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1392        .dwattr $C$DW$T$39, DW_AT_decl_line(0x53)
    1393        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1394$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    1395        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$39)
    1396
    1397$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1398        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1399$C$DW$114       .dwtag  DW_TAG_member
    1400        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1401        .dwattr $C$DW$114, DW_AT_name("STALLCOUNT")
    1402        .dwattr $C$DW$114, DW_AT_TI_symbol_name("STALLCOUNT")
    1403        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1404        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1406        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1407        .dwattr $C$DW$114, DW_AT_decl_line(0x5e)
    1408        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1409        .dwendtag $C$DW$T$40
    1410
    1411        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1412        .dwattr $C$DW$T$40, DW_AT_decl_line(0x5d)
    1413        .dwattr $C$DW$T$40, DW_AT_decl_column(0x14)
    1414$C$DW$T$82      .dwtag  DW_TAG_volatile_type
    1415        .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$40)
    1416
    1417$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1418        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1419$C$DW$115       .dwtag  DW_TAG_member
    1420        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1421        .dwattr $C$DW$115, DW_AT_name("C24_BLK_IDX")
    1422        .dwattr $C$DW$115, DW_AT_TI_symbol_name("C24_BLK_IDX")
    1423        .dwattr $C$DW$115, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1424        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1425        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1426        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1427        .dwattr $C$DW$115, DW_AT_decl_line(0x6b)
    1428        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1429$C$DW$116       .dwtag  DW_TAG_member
    1430        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.1.5 Mon Jul  9 19:24:00 2018

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/pru0-gen/cycle.asm                                              PAGE   27

    1431        .dwattr $C$DW$116, DW_AT_name("rsvd8")
    1432        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd8")
    1433        .dwattr $C$DW$116, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x08)
    1434        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1436        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1437        .dwattr $C$DW$116, DW_AT_decl_line(0x6c)
    1438        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1439$C$DW$117       .dwtag  DW_TAG_member
    1440        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1441        .dwattr $C$DW$117, DW_AT_name("C25_BLK_IDX")
    1442        .dwattr $C$DW$117, DW_AT_TI_symbol_name("C25_BLK_IDX")
    1443        .dwattr $C$DW$117, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1444        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1446        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1447        .dwattr $C$DW$117, DW_AT_decl_line(0x6d)
    1448        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1449$C$DW$118       .dwtag  DW_TAG_member
    1450        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1451        .dwattr $C$DW$118, DW_AT_name("rsvd24")
    1452        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd24")
    1453        .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1454        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1456        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1457        .dwattr $C$DW$118, DW_AT_decl_line(0x6e)
    1458        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1459        .dwendtag $C$DW$T$41
    1460
    1461        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1462        .dwattr $C$DW$T$41, DW_AT_decl_line(0x6a)
    1463        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1464$C$DW$T$84      .dwtag  DW_TAG_volatile_type
    1465        .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    1466
    1467$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1468        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1469$C$DW$119       .dwtag  DW_TAG_member
    1470        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1471        .dwattr $C$DW$119, DW_AT_name("C26_BLK_IDX")
    1472        .dwattr $C$DW$119, DW_AT_TI_symbol_name("C26_BLK_IDX")
    1473        .dwattr $C$DW$119, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1474        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1476        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1477        .dwattr $C$DW$119, DW_AT_decl_line(0x78)
    1478        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1479$C$DW$120       .dwtag  DW_TAG_member
    1480        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1481        .dwattr $C$DW$120, DW_AT_name("rsvd8")
    1482        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd8")
    1483        .dwattr $C$DW$120, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x08)
    1484        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
