PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.5 *
       3;* Date/Time created: Fri Jun  5 14:14:07 2020                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("cycle.pru0.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.5 Copyright (c) 2012-2017 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/PRUCookbook/docs/07more/code")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18        .weak   ||CT_CFG||
      19 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1

      84;***************************************************************
      85
      86||main||:
      87;* --------------------------------------------------------------------------*
      88;* r0_0  assigned to $O$C1
      89;* r14_0 assigned to cycle
      90$C$DW$5 .dwtag  DW_TAG_variable, DW_AT_name("cycle")
      91        .dwattr $C$DW$5, DW_AT_TI_symbol_name("cycle")
      92        .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$32)
      93        .dwattr $C$DW$5, DW_AT_location[DW_OP_regx 0x38]
      94        .dwcfi  cfa_offset, 0
      95        .dwpsn  file "cycle.pru0.c",line 21,column 2,is_stmt,isa 0
      96;----------------------------------------------------------------------
      97;  21 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
      98;----------------------------------------------------------------------
      99 00000000 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |21| CT_CFG
     100 00000004 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |21| 
     101 00000008 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |21| CT_CFG
     102        .dwpsn  file "cycle.pru0.c",line 23,column 2,is_stmt,isa 0
     103;----------------------------------------------------------------------
     104;  23 | PRU0_CTRL.CTRL_bit.CTR_EN = 1;  // Enable cycle counter                
     105;----------------------------------------------------------------------
     106 0000000c 200080240002C0          LDI32     r0, 0x00022000        ; [ALU_PRU] |23| $O$C1
     107 00000014 000000F1002081          LBBO      &r1, r0, 0, 4         ; [ALU_PRU] |23| 
     108 00000018 0000001F03E1E1          SET       r1, r1, 0x00000003    ; [ALU_PRU] |23| 
     109 0000001c 000000E1002081          SBBO      &r1, r0, 0, 4         ; [ALU_PRU] |23| 
     110        .dwpsn  file "cycle.pru0.c",line 25,column 2,is_stmt,isa 0
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    3

     111;----------------------------------------------------------------------
     112;  25 | __R30 |= gpio;                          // Set the GPIO pin to 1       
     113;  26 | // Reset cycle counter, cycle is on the right side to force the compile
     114;     | r                                                                      
     115;  27 | // to put it in it's own register                                      
     116;----------------------------------------------------------------------
     117 00000020 0000001F00FEFE          SET       r30, r30, 0x00000000  ; [ALU_PRU] |25| 
     118        .dwpsn  file "cycle.pru0.c",line 28,column 2,is_stmt,isa 0
     119;----------------------------------------------------------------------
     120;  28 | PRU0_CTRL.CYCLE = cycle;                                               
     121;----------------------------------------------------------------------
     122 00000024 000000E10C208E          SBBO      &r14, r0, 12, 4       ; [ALU_PRU] |28| $O$C1,cycle
     123        .dwpsn  file "cycle.pru0.c",line 29,column 2,is_stmt,isa 0
     124;----------------------------------------------------------------------
     125;  29 | __R30 &= ~gpio;                         // Clear the GPIO pin          
     126;----------------------------------------------------------------------
     127 00000028 0000001D00FEFE          CLR       r30, r30, 0x00000000  ; [ALU_PRU] |29| 
     128        .dwpsn  file "cycle.pru0.c",line 30,column 2,is_stmt,isa 0
     129;----------------------------------------------------------------------
     130;  30 | cycle = PRU0_CTRL.CYCLE;        // Read cycle and store in a register  
     131;----------------------------------------------------------------------
     132 0000002c 000000F10C2081          LBBO      &r1, r0, 12, 4        ; [ALU_PRU] |30| $O$C1
     133        .dwpsn  file "cycle.pru0.c",line 31,column 2,is_stmt,isa 0
     134;----------------------------------------------------------------------
     135;  31 | stall = PRU0_CTRL.STALL;        // Ditto for stall                     
     136;----------------------------------------------------------------------
     137 00000030 000000F1102080          LBBO      &r0, r0, 16, 4        ; [ALU_PRU] |31| $O$C1
     138        .dwpsn  file "cycle.pru0.c",line 33,column 2,is_stmt,isa 0
     139;----------------------------------------------------------------------
     140;  33 | __halt();                                                              
     141;----------------------------------------------------------------------
     142 00000034 0000002A000000          HALT      ; [ALU_PRU] |33| 
     143$C$DW$6 .dwtag  DW_TAG_TI_branch
     144        .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     145        .dwattr $C$DW$6, DW_AT_TI_return
     146 00000038 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     147        .dwattr $C$DW$4, DW_AT_TI_end_file("cycle.pru0.c")
     148        .dwattr $C$DW$4, DW_AT_TI_end_line(0x22)
     149        .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     150        .dwendentry
     151        .dwendtag $C$DW$4
     152
     153
     154;******************************************************************************
     155;* TYPE INFORMATION                                                           *
     156;******************************************************************************
     157
     158$C$DW$T$19      .dwtag  DW_TAG_structure_type
     159        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     160$C$DW$7 .dwtag  DW_TAG_member
     161        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     162        .dwattr $C$DW$7, DW_AT_name("REVID")
     163        .dwattr $C$DW$7, DW_AT_TI_symbol_name("REVID")
     164        .dwattr $C$DW$7, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     165        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    4

     166        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     167        .dwattr $C$DW$7, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     168        .dwattr $C$DW$7, DW_AT_decl_line(0x2d)
     169        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     170        .dwendtag $C$DW$T$19
     171
     172        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     173        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     174        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     175$C$DW$T$48      .dwtag  DW_TAG_volatile_type
     176        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
     177
     178$C$DW$T$20      .dwtag  DW_TAG_structure_type
     179        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     180$C$DW$8 .dwtag  DW_TAG_member
     181        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     182        .dwattr $C$DW$8, DW_AT_name("IDLE_MODE")
     183        .dwattr $C$DW$8, DW_AT_TI_symbol_name("IDLE_MODE")
     184        .dwattr $C$DW$8, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     185        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     186        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     187        .dwattr $C$DW$8, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     188        .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     189        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     190$C$DW$9 .dwtag  DW_TAG_member
     191        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     192        .dwattr $C$DW$9, DW_AT_name("STANDBY_MODE")
     193        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_MODE")
     194        .dwattr $C$DW$9, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     195        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     196        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     197        .dwattr $C$DW$9, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     198        .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     199        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     200$C$DW$10        .dwtag  DW_TAG_member
     201        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     202        .dwattr $C$DW$10, DW_AT_name("STANDBY_INIT")
     203        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_INIT")
     204        .dwattr $C$DW$10, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     205        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     206        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     207        .dwattr $C$DW$10, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     208        .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     209        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     210$C$DW$11        .dwtag  DW_TAG_member
     211        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     212        .dwattr $C$DW$11, DW_AT_name("SUB_MWAIT")
     213        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SUB_MWAIT")
     214        .dwattr $C$DW$11, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     215        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     216        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     217        .dwattr $C$DW$11, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     218        .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     219        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     220$C$DW$12        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    5

     221        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     222        .dwattr $C$DW$12, DW_AT_name("rsvd6")
     223        .dwattr $C$DW$12, DW_AT_TI_symbol_name("rsvd6")
     224        .dwattr $C$DW$12, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     225        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     226        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     227        .dwattr $C$DW$12, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     228        .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     229        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     230        .dwendtag $C$DW$T$20
     231
     232        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     233        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     234        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     235$C$DW$T$50      .dwtag  DW_TAG_volatile_type
     236        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$20)
     237
     238$C$DW$T$21      .dwtag  DW_TAG_structure_type
     239        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     240$C$DW$13        .dwtag  DW_TAG_member
     241        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     242        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_MODE")
     243        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     244        .dwattr $C$DW$13, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     245        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     246        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     247        .dwattr $C$DW$13, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     248        .dwattr $C$DW$13, DW_AT_decl_line(0x45)
     249        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     250$C$DW$14        .dwtag  DW_TAG_member
     251        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     252        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_CLK_MODE")
     253        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     254        .dwattr $C$DW$14, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     255        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     256        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     257        .dwattr $C$DW$14, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     258        .dwattr $C$DW$14, DW_AT_decl_line(0x46)
     259        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     260$C$DW$15        .dwtag  DW_TAG_member
     261        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     262        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV0")
     263        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     264        .dwattr $C$DW$15, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     265        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     266        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     267        .dwattr $C$DW$15, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     268        .dwattr $C$DW$15, DW_AT_decl_line(0x47)
     269        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     270$C$DW$16        .dwtag  DW_TAG_member
     271        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     272        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV1")
     273        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     274        .dwattr $C$DW$16, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     275        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    6

     276        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     277        .dwattr $C$DW$16, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     278        .dwattr $C$DW$16, DW_AT_decl_line(0x48)
     279        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     280$C$DW$17        .dwtag  DW_TAG_member
     281        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     282        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_SB")
     283        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     284        .dwattr $C$DW$17, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     285        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     286        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     287        .dwattr $C$DW$17, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     288        .dwattr $C$DW$17, DW_AT_decl_line(0x49)
     289        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     290$C$DW$18        .dwtag  DW_TAG_member
     291        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     292        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_MODE")
     293        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     294        .dwattr $C$DW$18, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     295        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     296        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     297        .dwattr $C$DW$18, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     298        .dwattr $C$DW$18, DW_AT_decl_line(0x4a)
     299        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     300$C$DW$19        .dwtag  DW_TAG_member
     301        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     302        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV0")
     303        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     304        .dwattr $C$DW$19, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     305        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     306        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     307        .dwattr $C$DW$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     308        .dwattr $C$DW$19, DW_AT_decl_line(0x4b)
     309        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     310$C$DW$20        .dwtag  DW_TAG_member
     311        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     312        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV1")
     313        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     314        .dwattr $C$DW$20, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     315        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     317        .dwattr $C$DW$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     318        .dwattr $C$DW$20, DW_AT_decl_line(0x4c)
     319        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     320$C$DW$21        .dwtag  DW_TAG_member
     321        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     322        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_SH_SEL")
     323        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     324        .dwattr $C$DW$21, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     325        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     326        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     327        .dwattr $C$DW$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     328        .dwattr $C$DW$21, DW_AT_decl_line(0x4d)
     329        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     330$C$DW$22        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    7

     331        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     332        .dwattr $C$DW$22, DW_AT_name("rsvd26")
     333        .dwattr $C$DW$22, DW_AT_TI_symbol_name("rsvd26")
     334        .dwattr $C$DW$22, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     335        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     336        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     337        .dwattr $C$DW$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     338        .dwattr $C$DW$22, DW_AT_decl_line(0x4e)
     339        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     340        .dwendtag $C$DW$T$21
     341
     342        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     343        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     344        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     345$C$DW$T$52      .dwtag  DW_TAG_volatile_type
     346        .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$21)
     347
     348$C$DW$T$22      .dwtag  DW_TAG_structure_type
     349        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     350$C$DW$23        .dwtag  DW_TAG_member
     351        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     352        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_MODE")
     353        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     354        .dwattr $C$DW$23, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     355        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     356        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     357        .dwattr $C$DW$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     358        .dwattr $C$DW$23, DW_AT_decl_line(0x58)
     359        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     360$C$DW$24        .dwtag  DW_TAG_member
     361        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     362        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_CLK_MODE")
     363        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     364        .dwattr $C$DW$24, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     365        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     366        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     367        .dwattr $C$DW$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     368        .dwattr $C$DW$24, DW_AT_decl_line(0x59)
     369        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     370$C$DW$25        .dwtag  DW_TAG_member
     371        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     372        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV0")
     373        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     374        .dwattr $C$DW$25, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     375        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     376        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     377        .dwattr $C$DW$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     378        .dwattr $C$DW$25, DW_AT_decl_line(0x5a)
     379        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     380$C$DW$26        .dwtag  DW_TAG_member
     381        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     382        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV1")
     383        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     384        .dwattr $C$DW$26, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     385        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    8

     386        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     387        .dwattr $C$DW$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     388        .dwattr $C$DW$26, DW_AT_decl_line(0x5b)
     389        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     390$C$DW$27        .dwtag  DW_TAG_member
     391        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     392        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_SB")
     393        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     394        .dwattr $C$DW$27, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     395        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     396        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     397        .dwattr $C$DW$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     398        .dwattr $C$DW$27, DW_AT_decl_line(0x5c)
     399        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     400$C$DW$28        .dwtag  DW_TAG_member
     401        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     402        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_MODE")
     403        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     404        .dwattr $C$DW$28, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     405        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     406        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     407        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     408        .dwattr $C$DW$28, DW_AT_decl_line(0x5d)
     409        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     410$C$DW$29        .dwtag  DW_TAG_member
     411        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     412        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV0")
     413        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     414        .dwattr $C$DW$29, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     415        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     416        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     417        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     418        .dwattr $C$DW$29, DW_AT_decl_line(0x5e)
     419        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     420$C$DW$30        .dwtag  DW_TAG_member
     421        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     422        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV1")
     423        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     424        .dwattr $C$DW$30, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     425        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     426        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     427        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     428        .dwattr $C$DW$30, DW_AT_decl_line(0x5f)
     429        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     430$C$DW$31        .dwtag  DW_TAG_member
     431        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     432        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_SH_SEL")
     433        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     434        .dwattr $C$DW$31, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     435        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     436        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     437        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     438        .dwattr $C$DW$31, DW_AT_decl_line(0x60)
     439        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     440$C$DW$32        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE    9

     441        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     442        .dwattr $C$DW$32, DW_AT_name("rsvd26")
     443        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd26")
     444        .dwattr $C$DW$32, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     445        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     446        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     447        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     448        .dwattr $C$DW$32, DW_AT_decl_line(0x61)
     449        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     450        .dwendtag $C$DW$T$22
     451
     452        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     453        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     454        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     455$C$DW$T$54      .dwtag  DW_TAG_volatile_type
     456        .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$22)
     457
     458$C$DW$T$23      .dwtag  DW_TAG_structure_type
     459        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     460$C$DW$33        .dwtag  DW_TAG_member
     461        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     462        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_REQ")
     463        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     464        .dwattr $C$DW$33, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     465        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     466        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     467        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     468        .dwattr $C$DW$33, DW_AT_decl_line(0x6b)
     469        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     470$C$DW$34        .dwtag  DW_TAG_member
     471        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     472        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_ACK")
     473        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     474        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     475        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     477        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     478        .dwattr $C$DW$34, DW_AT_decl_line(0x6c)
     479        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     480$C$DW$35        .dwtag  DW_TAG_member
     481        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     482        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_EN")
     483        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     484        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     485        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     486        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     487        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     488        .dwattr $C$DW$35, DW_AT_decl_line(0x6d)
     489        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     490$C$DW$36        .dwtag  DW_TAG_member
     491        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     492        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_REQ")
     493        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     494        .dwattr $C$DW$36, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     495        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   10

     496        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     497        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     498        .dwattr $C$DW$36, DW_AT_decl_line(0x6e)
     499        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     500$C$DW$37        .dwtag  DW_TAG_member
     501        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     502        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_ACK")
     503        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     504        .dwattr $C$DW$37, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     505        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     506        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     507        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     508        .dwattr $C$DW$37, DW_AT_decl_line(0x6f)
     509        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     510$C$DW$38        .dwtag  DW_TAG_member
     511        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     512        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_EN")
     513        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     514        .dwattr $C$DW$38, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     515        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     516        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     517        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     518        .dwattr $C$DW$38, DW_AT_decl_line(0x70)
     519        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     520$C$DW$39        .dwtag  DW_TAG_member
     521        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     522        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_REQ")
     523        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     524        .dwattr $C$DW$39, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     525        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     526        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     527        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     528        .dwattr $C$DW$39, DW_AT_decl_line(0x71)
     529        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     530$C$DW$40        .dwtag  DW_TAG_member
     531        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     532        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_ACK")
     533        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     534        .dwattr $C$DW$40, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     535        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     537        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     538        .dwattr $C$DW$40, DW_AT_decl_line(0x72)
     539        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     540$C$DW$41        .dwtag  DW_TAG_member
     541        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     542        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_EN")
     543        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_EN")
     544        .dwattr $C$DW$41, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     545        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     546        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     547        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     548        .dwattr $C$DW$41, DW_AT_decl_line(0x73)
     549        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     550$C$DW$42        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   11

     551        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     552        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_REQ")
     553        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     554        .dwattr $C$DW$42, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     555        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     557        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     558        .dwattr $C$DW$42, DW_AT_decl_line(0x74)
     559        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     560$C$DW$43        .dwtag  DW_TAG_member
     561        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     562        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_ACK")
     563        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     564        .dwattr $C$DW$43, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     565        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     567        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     568        .dwattr $C$DW$43, DW_AT_decl_line(0x75)
     569        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     570$C$DW$44        .dwtag  DW_TAG_member
     571        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     572        .dwattr $C$DW$44, DW_AT_name("UART_CLK_EN")
     573        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_EN")
     574        .dwattr $C$DW$44, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     575        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     577        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     578        .dwattr $C$DW$44, DW_AT_decl_line(0x76)
     579        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     580$C$DW$45        .dwtag  DW_TAG_member
     581        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     582        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_REQ")
     583        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     584        .dwattr $C$DW$45, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     585        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     586        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     587        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     588        .dwattr $C$DW$45, DW_AT_decl_line(0x77)
     589        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     590$C$DW$46        .dwtag  DW_TAG_member
     591        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     592        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_ACK")
     593        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     594        .dwattr $C$DW$46, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     595        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     597        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     598        .dwattr $C$DW$46, DW_AT_decl_line(0x78)
     599        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     600$C$DW$47        .dwtag  DW_TAG_member
     601        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     602        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_EN")
     603        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     604        .dwattr $C$DW$47, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     605        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   12

     606        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     607        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     608        .dwattr $C$DW$47, DW_AT_decl_line(0x79)
     609        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     610$C$DW$48        .dwtag  DW_TAG_member
     611        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     612        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_REQ")
     613        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     614        .dwattr $C$DW$48, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     615        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     617        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     618        .dwattr $C$DW$48, DW_AT_decl_line(0x7a)
     619        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     620$C$DW$49        .dwtag  DW_TAG_member
     621        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     622        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_ACK")
     623        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     624        .dwattr $C$DW$49, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     625        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     626        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     627        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     628        .dwattr $C$DW$49, DW_AT_decl_line(0x7b)
     629        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     630$C$DW$50        .dwtag  DW_TAG_member
     631        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     632        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_EN")
     633        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_EN")
     634        .dwattr $C$DW$50, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     635        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     637        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     638        .dwattr $C$DW$50, DW_AT_decl_line(0x7c)
     639        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     640$C$DW$51        .dwtag  DW_TAG_member
     641        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     642        .dwattr $C$DW$51, DW_AT_name("rsvd18")
     643        .dwattr $C$DW$51, DW_AT_TI_symbol_name("rsvd18")
     644        .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     645        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     647        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     648        .dwattr $C$DW$51, DW_AT_decl_line(0x7d)
     649        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     650        .dwendtag $C$DW$T$23
     651
     652        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     653        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     654        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     655$C$DW$T$56      .dwtag  DW_TAG_volatile_type
     656        .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$23)
     657
     658$C$DW$T$24      .dwtag  DW_TAG_structure_type
     659        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     660$C$DW$52        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   13

     661        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     662        .dwattr $C$DW$52, DW_AT_name("PRU0_IMEM_PE_RAW")
     663        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     664        .dwattr $C$DW$52, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     665        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     666        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     667        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     668        .dwattr $C$DW$52, DW_AT_decl_line(0x87)
     669        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     670$C$DW$53        .dwtag  DW_TAG_member
     671        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     672        .dwattr $C$DW$53, DW_AT_name("PRU0_DMEM_PE_RAW")
     673        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     674        .dwattr $C$DW$53, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     675        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     677        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     678        .dwattr $C$DW$53, DW_AT_decl_line(0x88)
     679        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     680$C$DW$54        .dwtag  DW_TAG_member
     681        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     682        .dwattr $C$DW$54, DW_AT_name("PRU1_IMEM_PE_RAW")
     683        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     684        .dwattr $C$DW$54, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     685        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     686        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     687        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     688        .dwattr $C$DW$54, DW_AT_decl_line(0x89)
     689        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     690$C$DW$55        .dwtag  DW_TAG_member
     691        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     692        .dwattr $C$DW$55, DW_AT_name("PRU1_DMEM_PE_RAW")
     693        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     694        .dwattr $C$DW$55, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     695        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     697        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     698        .dwattr $C$DW$55, DW_AT_decl_line(0x8a)
     699        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     700$C$DW$56        .dwtag  DW_TAG_member
     701        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     702        .dwattr $C$DW$56, DW_AT_name("RAM_PE_RAW")
     703        .dwattr $C$DW$56, DW_AT_TI_symbol_name("RAM_PE_RAW")
     704        .dwattr $C$DW$56, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     705        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     707        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     708        .dwattr $C$DW$56, DW_AT_decl_line(0x8b)
     709        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     710$C$DW$57        .dwtag  DW_TAG_member
     711        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     712        .dwattr $C$DW$57, DW_AT_name("rsvd20")
     713        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd20")
     714        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     715        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   14

     716        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     717        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     718        .dwattr $C$DW$57, DW_AT_decl_line(0x8c)
     719        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     720        .dwendtag $C$DW$T$24
     721
     722        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     723        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     724        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     725$C$DW$T$58      .dwtag  DW_TAG_volatile_type
     726        .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$24)
     727
     728$C$DW$T$25      .dwtag  DW_TAG_structure_type
     729        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     730$C$DW$58        .dwtag  DW_TAG_member
     731        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     732        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE")
     733        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     734        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     735        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     737        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     738        .dwattr $C$DW$58, DW_AT_decl_line(0x96)
     739        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     740$C$DW$59        .dwtag  DW_TAG_member
     741        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     742        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE")
     743        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     744        .dwattr $C$DW$59, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     745        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     747        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     748        .dwattr $C$DW$59, DW_AT_decl_line(0x97)
     749        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     750$C$DW$60        .dwtag  DW_TAG_member
     751        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     752        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE")
     753        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     754        .dwattr $C$DW$60, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     755        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     756        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     757        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     758        .dwattr $C$DW$60, DW_AT_decl_line(0x98)
     759        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     760$C$DW$61        .dwtag  DW_TAG_member
     761        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     762        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE")
     763        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     764        .dwattr $C$DW$61, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     765        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     767        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     768        .dwattr $C$DW$61, DW_AT_decl_line(0x99)
     769        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     770$C$DW$62        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   15

     771        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     772        .dwattr $C$DW$62, DW_AT_name("RAM_PE")
     773        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE")
     774        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     775        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     777        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     778        .dwattr $C$DW$62, DW_AT_decl_line(0x9a)
     779        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     780$C$DW$63        .dwtag  DW_TAG_member
     781        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     782        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     783        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     784        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     785        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     786        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     787        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     788        .dwattr $C$DW$63, DW_AT_decl_line(0x9b)
     789        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     790        .dwendtag $C$DW$T$25
     791
     792        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     793        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     794        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     795$C$DW$T$60      .dwtag  DW_TAG_volatile_type
     796        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$25)
     797
     798$C$DW$T$26      .dwtag  DW_TAG_structure_type
     799        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     800$C$DW$64        .dwtag  DW_TAG_member
     801        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     802        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE_SET")
     803        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     804        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     805        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     807        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     808        .dwattr $C$DW$64, DW_AT_decl_line(0xa4)
     809        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     810$C$DW$65        .dwtag  DW_TAG_member
     811        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     812        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE_SET")
     813        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     814        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     815        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     817        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     818        .dwattr $C$DW$65, DW_AT_decl_line(0xa5)
     819        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     820$C$DW$66        .dwtag  DW_TAG_member
     821        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     822        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE_SET")
     823        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     824        .dwattr $C$DW$66, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     825        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   16

     826        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     827        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     828        .dwattr $C$DW$66, DW_AT_decl_line(0xa6)
     829        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     830$C$DW$67        .dwtag  DW_TAG_member
     831        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     832        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE_SET")
     833        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     834        .dwattr $C$DW$67, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     835        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     837        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     838        .dwattr $C$DW$67, DW_AT_decl_line(0xa7)
     839        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     840$C$DW$68        .dwtag  DW_TAG_member
     841        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     842        .dwattr $C$DW$68, DW_AT_name("RAM_PE_SET")
     843        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE_SET")
     844        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     845        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     846        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     847        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     848        .dwattr $C$DW$68, DW_AT_decl_line(0xa8)
     849        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     850$C$DW$69        .dwtag  DW_TAG_member
     851        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     852        .dwattr $C$DW$69, DW_AT_name("rsvd20")
     853        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     854        .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     855        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     857        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     858        .dwattr $C$DW$69, DW_AT_decl_line(0xa9)
     859        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     860        .dwendtag $C$DW$T$26
     861
     862        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     863        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     864        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     865$C$DW$T$62      .dwtag  DW_TAG_volatile_type
     866        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$26)
     867
     868$C$DW$T$27      .dwtag  DW_TAG_structure_type
     869        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     870$C$DW$70        .dwtag  DW_TAG_member
     871        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     872        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_CLR")
     873        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     874        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     875        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     877        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     878        .dwattr $C$DW$70, DW_AT_decl_line(0xb3)
     879        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     880$C$DW$71        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   17

     881        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     882        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_CLR")
     883        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     884        .dwattr $C$DW$71, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     885        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     887        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     888        .dwattr $C$DW$71, DW_AT_decl_line(0xb4)
     889        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     890$C$DW$72        .dwtag  DW_TAG_member
     891        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     892        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_CLR")
     893        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     894        .dwattr $C$DW$72, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     895        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     896        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     897        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     898        .dwattr $C$DW$72, DW_AT_decl_line(0xb5)
     899        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     900$C$DW$73        .dwtag  DW_TAG_member
     901        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     902        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_CLR")
     903        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     904        .dwattr $C$DW$73, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     905        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     907        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     908        .dwattr $C$DW$73, DW_AT_decl_line(0xb6)
     909        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     910$C$DW$74        .dwtag  DW_TAG_member
     911        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     912        .dwattr $C$DW$74, DW_AT_name("rsvd16")
     913        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd16")
     914        .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     915        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     917        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     918        .dwattr $C$DW$74, DW_AT_decl_line(0xb7)
     919        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     920        .dwendtag $C$DW$T$27
     921
     922        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     923        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     924        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     925$C$DW$T$64      .dwtag  DW_TAG_volatile_type
     926        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$27)
     927
     928$C$DW$T$28      .dwtag  DW_TAG_structure_type
     929        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     930$C$DW$75        .dwtag  DW_TAG_member
     931        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     932        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU0")
     933        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU0")
     934        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     935        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   18

     936        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     937        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     938        .dwattr $C$DW$75, DW_AT_decl_line(0xc4)
     939        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     940$C$DW$76        .dwtag  DW_TAG_member
     941        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     942        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU1")
     943        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU1")
     944        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     945        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     947        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     948        .dwattr $C$DW$76, DW_AT_decl_line(0xc5)
     949        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     950$C$DW$77        .dwtag  DW_TAG_member
     951        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     952        .dwattr $C$DW$77, DW_AT_name("rsvd2")
     953        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd2")
     954        .dwattr $C$DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     955        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     957        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     958        .dwattr $C$DW$77, DW_AT_decl_line(0xc6)
     959        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     960        .dwendtag $C$DW$T$28
     961
     962        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     963        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     964        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     965$C$DW$T$66      .dwtag  DW_TAG_volatile_type
     966        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$28)
     967
     968$C$DW$T$29      .dwtag  DW_TAG_structure_type
     969        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     970$C$DW$78        .dwtag  DW_TAG_member
     971        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     972        .dwattr $C$DW$78, DW_AT_name("OCP_EN")
     973        .dwattr $C$DW$78, DW_AT_TI_symbol_name("OCP_EN")
     974        .dwattr $C$DW$78, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     975        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     977        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     978        .dwattr $C$DW$78, DW_AT_decl_line(0xd3)
     979        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     980$C$DW$79        .dwtag  DW_TAG_member
     981        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
     982        .dwattr $C$DW$79, DW_AT_name("rsvd1")
     983        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd1")
     984        .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
     985        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     987        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     988        .dwattr $C$DW$79, DW_AT_decl_line(0xd4)
     989        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     990        .dwendtag $C$DW$T$29
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   19

     991
     992        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     993        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
     994        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
     995$C$DW$T$68      .dwtag  DW_TAG_volatile_type
     996        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
     997
     998$C$DW$T$30      .dwtag  DW_TAG_structure_type
     999        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1000$C$DW$80        .dwtag  DW_TAG_member
    1001        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1002        .dwattr $C$DW$80, DW_AT_name("PRU1_PAD_HP_EN")
    1003        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1004        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1005        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1007        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1008        .dwattr $C$DW$80, DW_AT_decl_line(0xde)
    1009        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1010$C$DW$81        .dwtag  DW_TAG_member
    1011        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1012        .dwattr $C$DW$81, DW_AT_name("XFR_SHIFT_EN")
    1013        .dwattr $C$DW$81, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1014        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1015        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1017        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1018        .dwattr $C$DW$81, DW_AT_decl_line(0xdf)
    1019        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1020$C$DW$82        .dwtag  DW_TAG_member
    1021        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1022        .dwattr $C$DW$82, DW_AT_name("rsvd2")
    1023        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd2")
    1024        .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1025        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1027        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1028        .dwattr $C$DW$82, DW_AT_decl_line(0xe0)
    1029        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1030        .dwendtag $C$DW$T$30
    1031
    1032        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1033        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1034        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1035$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    1036        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$30)
    1037
    1038$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1039        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1040$C$DW$83        .dwtag  DW_TAG_member
    1041        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1042        .dwattr $C$DW$83, DW_AT_name("PIN_MUX_SEL")
    1043        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1044        .dwattr $C$DW$83, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1045        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   20

    1046        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1047        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1048        .dwattr $C$DW$83, DW_AT_decl_line(0xec)
    1049        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1050$C$DW$84        .dwtag  DW_TAG_member
    1051        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1052        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1053        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1054        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1055        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1057        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1058        .dwattr $C$DW$84, DW_AT_decl_line(0xed)
    1059        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1060        .dwendtag $C$DW$T$31
    1061
    1062        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1063        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1064        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1065$C$DW$T$72      .dwtag  DW_TAG_volatile_type
    1066        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$31)
    1067
    1068$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1069        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1070$C$DW$85        .dwtag  DW_TAG_member
    1071        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$49)
    1072        .dwattr $C$DW$85, DW_AT_name("$P$T0")
    1073        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T0")
    1074        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1076        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1077        .dwattr $C$DW$85, DW_AT_decl_line(0x29)
    1078        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1079$C$DW$86        .dwtag  DW_TAG_member
    1080        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$51)
    1081        .dwattr $C$DW$86, DW_AT_name("$P$T1")
    1082        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T1")
    1083        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1084        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1085        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1086        .dwattr $C$DW$86, DW_AT_decl_line(0x33)
    1087        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1088$C$DW$87        .dwtag  DW_TAG_member
    1089        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$53)
    1090        .dwattr $C$DW$87, DW_AT_name("$P$T2")
    1091        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T2")
    1092        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1093        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1094        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1095        .dwattr $C$DW$87, DW_AT_decl_line(0x41)
    1096        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1097$C$DW$88        .dwtag  DW_TAG_member
    1098        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$55)
    1099        .dwattr $C$DW$88, DW_AT_name("$P$T3")
    1100        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T3")
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   21

    1101        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1102        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1103        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1104        .dwattr $C$DW$88, DW_AT_decl_line(0x54)
    1105        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1106$C$DW$89        .dwtag  DW_TAG_member
    1107        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$57)
    1108        .dwattr $C$DW$89, DW_AT_name("$P$T4")
    1109        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T4")
    1110        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1111        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1112        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1113        .dwattr $C$DW$89, DW_AT_decl_line(0x67)
    1114        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1115$C$DW$90        .dwtag  DW_TAG_member
    1116        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$59)
    1117        .dwattr $C$DW$90, DW_AT_name("$P$T5")
    1118        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T5")
    1119        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1120        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1121        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1122        .dwattr $C$DW$90, DW_AT_decl_line(0x83)
    1123        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1124$C$DW$91        .dwtag  DW_TAG_member
    1125        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$61)
    1126        .dwattr $C$DW$91, DW_AT_name("$P$T6")
    1127        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T6")
    1128        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1129        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1130        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1131        .dwattr $C$DW$91, DW_AT_decl_line(0x92)
    1132        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1133$C$DW$92        .dwtag  DW_TAG_member
    1134        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$63)
    1135        .dwattr $C$DW$92, DW_AT_name("$P$T7")
    1136        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T7")
    1137        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1138        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1139        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1140        .dwattr $C$DW$92, DW_AT_decl_line(0xa0)
    1141        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1142$C$DW$93        .dwtag  DW_TAG_member
    1143        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$65)
    1144        .dwattr $C$DW$93, DW_AT_name("$P$T8")
    1145        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T8")
    1146        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1147        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1148        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1149        .dwattr $C$DW$93, DW_AT_decl_line(0xaf)
    1150        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1151$C$DW$94        .dwtag  DW_TAG_member
    1152        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
    1153        .dwattr $C$DW$94, DW_AT_name("rsvd24")
    1154        .dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd24")
    1155        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   22

    1156        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1157        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1158        .dwattr $C$DW$94, DW_AT_decl_line(0xbc)
    1159        .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1160$C$DW$95        .dwtag  DW_TAG_member
    1161        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$67)
    1162        .dwattr $C$DW$95, DW_AT_name("$P$T9")
    1163        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T9")
    1164        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1165        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1166        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1167        .dwattr $C$DW$95, DW_AT_decl_line(0xc0)
    1168        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1169$C$DW$96        .dwtag  DW_TAG_member
    1170        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1171        .dwattr $C$DW$96, DW_AT_name("rsvd2c")
    1172        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd2c")
    1173        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1174        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1175        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1176        .dwattr $C$DW$96, DW_AT_decl_line(0xcb)
    1177        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1178$C$DW$97        .dwtag  DW_TAG_member
    1179        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$69)
    1180        .dwattr $C$DW$97, DW_AT_name("$P$T10")
    1181        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T10")
    1182        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1183        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1184        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1185        .dwattr $C$DW$97, DW_AT_decl_line(0xcf)
    1186        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1187$C$DW$98        .dwtag  DW_TAG_member
    1188        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$71)
    1189        .dwattr $C$DW$98, DW_AT_name("$P$T11")
    1190        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T11")
    1191        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1192        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1193        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1194        .dwattr $C$DW$98, DW_AT_decl_line(0xda)
    1195        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1196$C$DW$99        .dwtag  DW_TAG_member
    1197        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1198        .dwattr $C$DW$99, DW_AT_name("rsvd38")
    1199        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd38")
    1200        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1201        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1202        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1203        .dwattr $C$DW$99, DW_AT_decl_line(0xe5)
    1204        .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1205$C$DW$100       .dwtag  DW_TAG_member
    1206        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$73)
    1207        .dwattr $C$DW$100, DW_AT_name("$P$T12")
    1208        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T12")
    1209        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1210        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   23

    1211        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1212        .dwattr $C$DW$100, DW_AT_decl_line(0xe8)
    1213        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1214        .dwendtag $C$DW$T$35
    1215
    1216        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1217        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1218        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1219$C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1220        .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$35)
    1221        .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1222        .dwattr $C$DW$T$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1223        .dwattr $C$DW$T$97, DW_AT_decl_line(0xf0)
    1224        .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    1225$C$DW$T$98      .dwtag  DW_TAG_volatile_type
    1226        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    1227
    1228$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1229        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1230$C$DW$101       .dwtag  DW_TAG_member
    1231        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1232        .dwattr $C$DW$101, DW_AT_name("SOFT_RST_N")
    1233        .dwattr $C$DW$101, DW_AT_TI_symbol_name("SOFT_RST_N")
    1234        .dwattr $C$DW$101, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1235        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1237        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1238        .dwattr $C$DW$101, DW_AT_decl_line(0x2d)
    1239        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1240$C$DW$102       .dwtag  DW_TAG_member
    1241        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1242        .dwattr $C$DW$102, DW_AT_name("EN")
    1243        .dwattr $C$DW$102, DW_AT_TI_symbol_name("EN")
    1244        .dwattr $C$DW$102, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1245        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1247        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1248        .dwattr $C$DW$102, DW_AT_decl_line(0x2e)
    1249        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1250$C$DW$103       .dwtag  DW_TAG_member
    1251        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1252        .dwattr $C$DW$103, DW_AT_name("SLEEPING")
    1253        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SLEEPING")
    1254        .dwattr $C$DW$103, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1255        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1257        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1258        .dwattr $C$DW$103, DW_AT_decl_line(0x2f)
    1259        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1260$C$DW$104       .dwtag  DW_TAG_member
    1261        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1262        .dwattr $C$DW$104, DW_AT_name("CTR_EN")
    1263        .dwattr $C$DW$104, DW_AT_TI_symbol_name("CTR_EN")
    1264        .dwattr $C$DW$104, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1265        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   24

    1266        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1267        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1268        .dwattr $C$DW$104, DW_AT_decl_line(0x30)
    1269        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1270$C$DW$105       .dwtag  DW_TAG_member
    1271        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1272        .dwattr $C$DW$105, DW_AT_name("rsvd4")
    1273        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd4")
    1274        .dwattr $C$DW$105, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1275        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1277        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1278        .dwattr $C$DW$105, DW_AT_decl_line(0x31)
    1279        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1280$C$DW$106       .dwtag  DW_TAG_member
    1281        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1282        .dwattr $C$DW$106, DW_AT_name("SINGLE_STEP")
    1283        .dwattr $C$DW$106, DW_AT_TI_symbol_name("SINGLE_STEP")
    1284        .dwattr $C$DW$106, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1285        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1287        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1288        .dwattr $C$DW$106, DW_AT_decl_line(0x32)
    1289        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1290$C$DW$107       .dwtag  DW_TAG_member
    1291        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1292        .dwattr $C$DW$107, DW_AT_name("rsvd9")
    1293        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd9")
    1294        .dwattr $C$DW$107, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x06)
    1295        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1297        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1298        .dwattr $C$DW$107, DW_AT_decl_line(0x33)
    1299        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1300$C$DW$108       .dwtag  DW_TAG_member
    1301        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1302        .dwattr $C$DW$108, DW_AT_name("RUNSTATE")
    1303        .dwattr $C$DW$108, DW_AT_TI_symbol_name("RUNSTATE")
    1304        .dwattr $C$DW$108, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1305        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1307        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1308        .dwattr $C$DW$108, DW_AT_decl_line(0x34)
    1309        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1310$C$DW$109       .dwtag  DW_TAG_member
    1311        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1312        .dwattr $C$DW$109, DW_AT_name("PCTR_RST_VAL")
    1313        .dwattr $C$DW$109, DW_AT_TI_symbol_name("PCTR_RST_VAL")
    1314        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1315        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1317        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1318        .dwattr $C$DW$109, DW_AT_decl_line(0x35)
    1319        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1320        .dwendtag $C$DW$T$36
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   25

    1321
    1322        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1323        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    1324        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1325$C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1326        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    1327
    1328$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1329        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1330$C$DW$110       .dwtag  DW_TAG_member
    1331        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1332        .dwattr $C$DW$110, DW_AT_name("PCTR")
    1333        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PCTR")
    1334        .dwattr $C$DW$110, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x10)
    1335        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1337        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1338        .dwattr $C$DW$110, DW_AT_decl_line(0x3f)
    1339        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1340$C$DW$111       .dwtag  DW_TAG_member
    1341        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1342        .dwattr $C$DW$111, DW_AT_name("rsvd16")
    1343        .dwattr $C$DW$111, DW_AT_TI_symbol_name("rsvd16")
    1344        .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1345        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1347        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1348        .dwattr $C$DW$111, DW_AT_decl_line(0x40)
    1349        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1350        .dwendtag $C$DW$T$37
    1351
    1352        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1353        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3e)
    1354        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1355$C$DW$T$76      .dwtag  DW_TAG_volatile_type
    1356        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$37)
    1357
    1358$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1359        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1360$C$DW$112       .dwtag  DW_TAG_member
    1361        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1362        .dwattr $C$DW$112, DW_AT_name("BITWISE_ENS")
    1363        .dwattr $C$DW$112, DW_AT_TI_symbol_name("BITWISE_ENS")
    1364        .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1365        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1367        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1368        .dwattr $C$DW$112, DW_AT_decl_line(0x4a)
    1369        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1370        .dwendtag $C$DW$T$38
    1371
    1372        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1373        .dwattr $C$DW$T$38, DW_AT_decl_line(0x49)
    1374        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1375$C$DW$T$78      .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   26

    1376        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$38)
    1377
    1378$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1379        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1380$C$DW$113       .dwtag  DW_TAG_member
    1381        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1382        .dwattr $C$DW$113, DW_AT_name("CYCLECOUNT")
    1383        .dwattr $C$DW$113, DW_AT_TI_symbol_name("CYCLECOUNT")
    1384        .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1385        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1387        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1388        .dwattr $C$DW$113, DW_AT_decl_line(0x54)
    1389        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1390        .dwendtag $C$DW$T$39
    1391
    1392        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1393        .dwattr $C$DW$T$39, DW_AT_decl_line(0x53)
    1394        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1395$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    1396        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$39)
    1397
    1398$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1399        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1400$C$DW$114       .dwtag  DW_TAG_member
    1401        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1402        .dwattr $C$DW$114, DW_AT_name("STALLCOUNT")
    1403        .dwattr $C$DW$114, DW_AT_TI_symbol_name("STALLCOUNT")
    1404        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1405        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1407        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1408        .dwattr $C$DW$114, DW_AT_decl_line(0x5e)
    1409        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1410        .dwendtag $C$DW$T$40
    1411
    1412        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1413        .dwattr $C$DW$T$40, DW_AT_decl_line(0x5d)
    1414        .dwattr $C$DW$T$40, DW_AT_decl_column(0x14)
    1415$C$DW$T$82      .dwtag  DW_TAG_volatile_type
    1416        .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$40)
    1417
    1418$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1419        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1420$C$DW$115       .dwtag  DW_TAG_member
    1421        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1422        .dwattr $C$DW$115, DW_AT_name("C24_BLK_IDX")
    1423        .dwattr $C$DW$115, DW_AT_TI_symbol_name("C24_BLK_IDX")
    1424        .dwattr $C$DW$115, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1425        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1427        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1428        .dwattr $C$DW$115, DW_AT_decl_line(0x6b)
    1429        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1430$C$DW$116       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.5 Fri Jun  5 14:14:07 2020

Tools Copyright (c) 2012-2017 Texas Instruments Incorporated
/tmp/cloud9-examples/cycle.pru0.asm                                  PAGE   27

    1431        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1432        .dwattr $C$DW$116, DW_AT_name("rsvd8")
    1433        .dwattr $C$DW$116, DW_AT_TI_symbol_name("rsvd8")
    1434        .dwattr $C$DW$116, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x08)
    1435        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1437        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1438        .dwattr $C$DW$116, DW_AT_decl_line(0x6c)
    1439        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1440$C$DW$117       .dwtag  DW_TAG_member
    1441        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1442        .dwattr $C$DW$117, DW_AT_name("C25_BLK_IDX")
    1443        .dwattr $C$DW$117, DW_AT_TI_symbol_name("C25_BLK_IDX")
    1444        .dwattr $C$DW$117, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1445        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1447        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1448        .dwattr $C$DW$117, DW_AT_decl_line(0x6d)
    1449        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1450$C$DW$118       .dwtag  DW_TAG_member
    1451        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1452        .dwattr $C$DW$118, DW_AT_name("rsvd24")
    1453        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd24")
    1454        .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1455        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1457        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1458        .dwattr $C$DW$118, DW_AT_decl_line(0x6e)
    1459        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1460        .dwendtag $C$DW$T$41
    1461
    1462        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1463        .dwattr $C$DW$T$41, DW_AT_decl_line(0x6a)
    1464        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1465$C$DW$T$84      .dwtag  DW_TAG_volatile_type
    1466        .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    1467
    1468$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1469        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1470$C$DW$119       .dwtag  DW_TAG_member
    1471        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1472        .dwattr $C$DW$119, DW_AT_name("C26_BLK_IDX")
    1473        .dwattr $C$DW$119, DW_AT_TI_symbol_name("C26_BLK_IDX")
    1474        .dwattr $C$DW$119, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1475        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1477        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1478        .dwattr $C$DW$119, DW_AT_decl_line(0x78)
    1479        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1480$C$DW$120       .dwtag  DW_TAG_member
    1481        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1482        .dwattr $C$DW$120, DW_AT_name("rsvd8")
    1483        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd8")
    1484        .dwattr $C$DW$120, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x08)
    1485        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
